---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SlabEdgeProfileParam
source: html/8fe881c3-3a50-e0ce-0a1e-569214229cca.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SlabEdgeProfileParam Property

"Profile"

## Syntax (C#)
```csharp
public static ForgeTypeId SlabEdgeProfileParam { get; }
```